tut04/sol04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-02 Do 13:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lösungen zum 4. Übungsblatt</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Lösungen zum 4. Übungsblatt</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga30b18a">1. Lösungen zu Aufgabe 1 (AGS 12.1.16a, 12.1.48b,c, 12.1.56)</a>
<ul>
<li><a href="#orgd482d7d">1.1. Teilaufgabe a</a></li>
<li><a href="#orgcdedeee">1.2. Teilaufgabe b</a></li>
<li><a href="#orgc7692ff">1.3. Teilaufgabe c</a></li>
<li><a href="#org92a75cd">1.4. Teilaufgabe d</a></li>
</ul>
</li>
<li><a href="#org313edc7">2. Lösungen zu Aufgabe 2 (AGS 12.1.51a,b)</a>
<ul>
<li><a href="#orgac166de">2.1. Teilaufgabe a</a></li>
<li><a href="#org509cd7d">2.2. Teilaufgabe b</a></li>
</ul>
</li>
<li><a href="#org2298c5f">3. Lösungen zu Aufgabe 3 (AGS 12.2.12)</a>
<ul>
<li><a href="#org166a612">3.1. Teilaufgabe a</a></li>
<li><a href="#orga6b612f">3.2. Teilaufgabe b</a></li>
<li><a href="#org74dfbb4">3.3. Teilaufgabe</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga30b18a" class="outline-2">
<h2 id="orga30b18a"><span class="section-number-2">1</span> Lösungen zu Aufgabe 1 (AGS 12.1.16a, 12.1.48b,c, 12.1.56)</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">data</span> <span style="color: #b58900;">Tree</span> a <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Branch</span> a <span style="color: #2aa198;">(</span><span style="color: #b58900;">Tree</span> a<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">Tree</span> a<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">Leaf</span> a
</pre>
</div>
</div>

<div id="outline-container-orgd482d7d" class="outline-3">
<h3 id="orgd482d7d"><span class="section-number-3">1.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">tree</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Tree</span> <span style="color: #b58900;">Int</span>
<span style="color: #268bd2;">tree</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Branch</span> <span style="color: #6c71c4;">5</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">Branch</span> <span style="color: #6c71c4;">4</span> <span style="color: #b58900;">(</span><span style="color: #b58900;">Leaf</span> <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span>
                          <span style="color: #b58900;">(</span><span style="color: #b58900;">Leaf</span> <span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span>
                <span style="color: #2aa198;">)</span>
                <span style="color: #2aa198;">(</span><span style="color: #b58900;">Branch</span> <span style="color: #6c71c4;">3</span> <span style="color: #b58900;">(</span><span style="color: #b58900;">Branch</span> <span style="color: #6c71c4;">5</span> <span style="color: #268bd2;">(</span><span style="color: #b58900;">Leaf</span> <span style="color: #6c71c4;">3</span><span style="color: #268bd2;">)</span>
                                    <span style="color: #268bd2;">(</span><span style="color: #b58900;">Leaf</span> <span style="color: #6c71c4;">4</span><span style="color: #268bd2;">)</span>
                          <span style="color: #b58900;">)</span>
                          <span style="color: #b58900;">(</span><span style="color: #b58900;">Leaf</span> <span style="color: #6c71c4;">5</span><span style="color: #b58900;">)</span>
                <span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcdedeee" class="outline-3">
<h3 id="orgcdedeee"><span class="section-number-3">1.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">depth</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Tree</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Int</span>
<span style="color: #268bd2;">depth</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">Branch</span> <span style="color: #859900; font-weight: bold;">_</span> s t<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #6c71c4;">1</span> <span style="color: #268bd2;">+</span> depth s <span style="color: #268bd2;">`min`</span> depth t
<span style="color: #268bd2;">depth</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">Leaf</span> <span style="color: #859900; font-weight: bold;">_</span><span style="color: #2aa198;">)</span>       <span style="color: #268bd2;">=</span> <span style="color: #6c71c4;">1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7692ff" class="outline-3">
<h3 id="orgc7692ff"><span class="section-number-3">1.3</span> Teilaufgabe c</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">paths</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Tree</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Tree</span> <span style="color: #2aa198;">[</span>a<span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">paths</span> <span style="color: #268bd2;">=</span> paths' <span style="color: #2aa198;">[]</span>

<span style="color: #268bd2;">paths'</span> <span style="color: #268bd2;">::</span> <span style="color: #2aa198;">[</span>a<span style="color: #2aa198;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Tree</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Tree</span> <span style="color: #2aa198;">[</span>a<span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">paths'</span> prefix <span style="color: #2aa198;">(</span><span style="color: #b58900;">Branch</span> a s t<span style="color: #2aa198;">)</span>
  <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Branch</span> pr' <span style="color: #2aa198;">(</span>paths' pr' s<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span>paths' pr' t<span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">where</span> pr' <span style="color: #268bd2;">=</span> prefix <span style="color: #268bd2;">++</span> <span style="color: #2aa198;">[</span>a<span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">paths'</span> prefix <span style="color: #2aa198;">(</span><span style="color: #b58900;">Leaf</span> a<span style="color: #2aa198;">)</span>
  <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Leaf</span> <span style="color: #268bd2;">$</span> prefix <span style="color: #268bd2;">++</span> <span style="color: #2aa198;">[</span>a<span style="color: #2aa198;">]</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-org92a75cd" class="outline-3">
<h3 id="org92a75cd"><span class="section-number-3">1.4</span> Teilaufgabe d</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">tmap</span> <span style="color: #268bd2;">::</span> <span style="color: #2aa198;">(</span>a <span style="color: #268bd2;">-&gt;</span> b<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Tree</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Tree</span> b
<span style="color: #268bd2;">tmap</span> f <span style="color: #2aa198;">(</span><span style="color: #b58900;">Branch</span> a s t<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Branch</span> <span style="color: #2aa198;">(</span>f a<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span>tmap f s<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span>tmap f t<span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">tmap</span> f <span style="color: #2aa198;">(</span><span style="color: #b58900;">Leaf</span> a<span style="color: #2aa198;">)</span>       <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Leaf</span> <span style="color: #268bd2;">$</span> f a
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org313edc7" class="outline-2">
<h2 id="org313edc7"><span class="section-number-2">2</span> Lösungen zu Aufgabe 2 (AGS 12.1.51a,b)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgac166de" class="outline-3">
<h3 id="orgac166de"><span class="section-number-3">2.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">unzip</span> <span style="color: #268bd2;">::</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span>a,b<span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">[</span>a<span style="color: #b58900;">]</span>, <span style="color: #b58900;">[</span>b<span style="color: #b58900;">]</span><span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">unzip</span> <span style="color: #2aa198;">[]</span> <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">[]</span>, <span style="color: #b58900;">[]</span><span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">unzip</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span>a, b<span style="color: #b58900;">)</span> <span style="color: #b58900;">:</span> xs<span style="color: #2aa198;">)</span>
  <span style="color: #268bd2;">=</span> <span style="color: #859900; font-weight: bold;">let</span> <span style="color: #2aa198;">(</span>as, bs<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> unzip xs
    <span style="color: #859900; font-weight: bold;">in</span>  <span style="color: #2aa198;">(</span>a <span style="color: #b58900;">:</span> as, b <span style="color: #b58900;">:</span> bs<span style="color: #2aa198;">)</span> 
</pre>
</div>

<ul class="org-ul">
<li>Typeclassopedia</li>
</ul>
</div>
</div>

<div id="outline-container-org509cd7d" class="outline-3">
<h3 id="org509cd7d"><span class="section-number-3">2.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">map</span> <span style="color: #268bd2;">::</span> <span style="color: #2aa198;">(</span>a <span style="color: #268bd2;">-&gt;</span> b<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #2aa198;">[</span>a<span style="color: #2aa198;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #2aa198;">[</span>b<span style="color: #2aa198;">]</span>           <span style="color: #93a1a1;">-- </span><span style="color: #93a1a1;">1</span>
<span style="color: #268bd2;">map</span> <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #2aa198;">[]</span>     <span style="color: #268bd2;">=</span> <span style="color: #2aa198;">[]</span>                       <span style="color: #93a1a1;">-- </span><span style="color: #93a1a1;">2</span>
<span style="color: #268bd2;">map</span> f <span style="color: #2aa198;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> f x <span style="color: #b58900;">:</span> map f xs           <span style="color: #93a1a1;">-- </span><span style="color: #93a1a1;">3</span>

<span style="color: #268bd2;">uncurry</span> <span style="color: #268bd2;">::</span> <span style="color: #2aa198;">(</span>a <span style="color: #268bd2;">-&gt;</span> b <span style="color: #268bd2;">-&gt;</span> c<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #2aa198;">(</span>a, b<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">-&gt;</span> c <span style="color: #93a1a1;">-- </span><span style="color: #93a1a1;">5</span>
<span style="color: #268bd2;">uncurry</span> f <span style="color: #2aa198;">(</span>x, y<span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> f x y                <span style="color: #93a1a1;">-- </span><span style="color: #93a1a1;">6</span>

<span style="color: #268bd2;">map</span> <span style="color: #2aa198;">(</span>uncurry <span style="color: #b58900;">(</span><span style="color: #268bd2;">+</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #6c71c4;">1</span>,<span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span>, <span style="color: #b58900;">(</span><span style="color: #6c71c4;">3</span>,<span style="color: #6c71c4;">4</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">=</span>&#179; uncurry <span style="color: #2aa198;">(</span><span style="color: #268bd2;">+</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span><span style="color: #6c71c4;">1</span>,<span style="color: #6c71c4;">2</span><span style="color: #2aa198;">)</span> <span style="color: #b58900;">:</span> map <span style="color: #2aa198;">(</span>uncurry <span style="color: #b58900;">(</span><span style="color: #268bd2;">+</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #6c71c4;">3</span>,<span style="color: #6c71c4;">4</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">=</span>&#8310; <span style="color: #2aa198;">(</span><span style="color: #268bd2;">+</span><span style="color: #2aa198;">)</span> <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #b58900;">:</span> map <span style="color: #2aa198;">(</span>uncurry <span style="color: #b58900;">(</span><span style="color: #268bd2;">+</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #6c71c4;">3</span>,<span style="color: #6c71c4;">4</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">=</span>  <span style="color: #6c71c4;">3</span> <span style="color: #b58900;">:</span> map <span style="color: #2aa198;">(</span>uncurry <span style="color: #b58900;">(</span><span style="color: #268bd2;">+</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #6c71c4;">3</span>,<span style="color: #6c71c4;">4</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span>
<span style="color: #268bd2;">=</span>&#179; <span style="color: #6c71c4;">3</span> <span style="color: #b58900;">:</span> uncurry <span style="color: #2aa198;">(</span><span style="color: #268bd2;">+</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">(</span><span style="color: #6c71c4;">3</span>,<span style="color: #6c71c4;">4</span><span style="color: #2aa198;">)</span> <span style="color: #b58900;">:</span> map <span style="color: #2aa198;">(</span>uncurry <span style="color: #b58900;">(</span><span style="color: #268bd2;">+</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">[]</span>
<span style="color: #268bd2;">=</span>&#8310; <span style="color: #6c71c4;">3</span> <span style="color: #b58900;">:</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">+</span><span style="color: #2aa198;">)</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #b58900;">:</span> map <span style="color: #2aa198;">(</span>uncurry <span style="color: #b58900;">(</span><span style="color: #268bd2;">+</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">[]</span>
<span style="color: #268bd2;">=</span>  <span style="color: #6c71c4;">3</span> <span style="color: #b58900;">:</span> <span style="color: #6c71c4;">7</span> <span style="color: #b58900;">:</span> map <span style="color: #2aa198;">(</span>uncurry <span style="color: #b58900;">(</span><span style="color: #268bd2;">+</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">[]</span>
<span style="color: #268bd2;">=</span>&#178; <span style="color: #6c71c4;">3</span> <span style="color: #b58900;">:</span> <span style="color: #6c71c4;">7</span> <span style="color: #b58900;">:</span> <span style="color: #2aa198;">[]</span>
<span style="color: #268bd2;">&#8801;</span>  <span style="color: #2aa198;">[</span><span style="color: #6c71c4;">3</span>,<span style="color: #6c71c4;">7</span><span style="color: #2aa198;">]</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2298c5f" class="outline-2">
<h2 id="org2298c5f"><span class="section-number-2">3</span> Lösungen zu Aufgabe 3 (AGS 12.2.12)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org166a612" class="outline-3">
<h3 id="org166a612"><span class="section-number-3">3.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-elisp">&#9127; &#9115; &#963;<span style="color: #2aa198;">(</span>&#963;<span style="color: #b58900;">(</span>x&#8321;   , &#945;<span style="color: #b58900;">)</span>, &#963;<span style="color: #b58900;">(</span>&#947;<span style="color: #268bd2;">(</span>x&#8323;<span style="color: #268bd2;">)</span>, x&#8323;<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> &#9118; &#9131;
&#9128; &#9117; &#963;<span style="color: #2aa198;">(</span>&#963;<span style="color: #b58900;">(</span>&#947;<span style="color: #268bd2;">(</span>x&#8322;<span style="color: #268bd2;">)</span>, &#945;<span style="color: #b58900;">)</span>, &#963;<span style="color: #b58900;">(</span>x&#8322;   , x&#8323;<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> &#9120; &#9132;
&#9129;                                  &#9133;

Dek &#9127; &#9115; &#963;<span style="color: #2aa198;">(</span>x&#8321;   , &#945;<span style="color: #2aa198;">)</span> &#9118;  &#9115; &#963;<span style="color: #2aa198;">(</span>&#947;<span style="color: #b58900;">(</span>x&#8323;<span style="color: #b58900;">)</span>, x&#8323;<span style="color: #2aa198;">)</span> &#9118; &#9131;
==&gt; &#9128; &#9117; &#963;<span style="color: #2aa198;">(</span>&#947;<span style="color: #b58900;">(</span>x&#8322;<span style="color: #b58900;">)</span>, &#945;<span style="color: #2aa198;">)</span> &#9120;, &#9117; &#963;<span style="color: #2aa198;">(</span>x&#8322;   , x&#8323;<span style="color: #2aa198;">)</span> &#9120; &#9132;
    &#9129; ===============  ================ &#9133;

Dek &#9127; &#9115;x&#8321;   &#9118;  &#9115;&#945;&#9118;  &#9115;&#947;<span style="color: #2aa198;">(</span>x&#8323;<span style="color: #2aa198;">)</span>&#9118;  &#9115;x&#8323;&#9118; &#9131;
==&gt; &#9128; &#9117;&#947;<span style="color: #2aa198;">(</span>x&#8322;<span style="color: #2aa198;">)</span>&#9120;, &#9117;&#945;&#9120;, &#9117;x&#8322;   &#9120;, &#9117;x&#8323;&#9120; &#9132;
    &#9129;          ===                &#9133; 

Dek &#9127; &#9115;x&#8321;   &#9118;  &#9115;&#947;<span style="color: #2aa198;">(</span>x&#8323;<span style="color: #2aa198;">)</span>&#9118;  &#9115;x&#8323;&#9118; &#9131;
==&gt; &#9128; &#9117;&#947;<span style="color: #2aa198;">(</span>x&#8322;<span style="color: #2aa198;">)</span>&#9120;, &#9117;x&#8322;   &#9120;, &#9117;x&#8323;&#9120; &#9132;
    &#9129;                   ==== &#9133; 

El  &#9127; &#9115;x&#8321;   &#9118;  &#9115;&#947;<span style="color: #2aa198;">(</span>x&#8323;<span style="color: #2aa198;">)</span>&#9118; &#9131;
==&gt; &#9128; &#9117;&#947;<span style="color: #2aa198;">(</span>x&#8322;<span style="color: #2aa198;">)</span>&#9120;, &#9117;x&#8322;   &#9120; &#9132;
    &#9129;          ======= &#9133; 

Vert &#9127; &#9115;x&#8321;   &#9118;  &#9115;x&#8322;   &#9118; &#9131;
==&gt;  &#9128; &#9117;&#947;<span style="color: #2aa198;">(</span>x&#8322;<span style="color: #2aa198;">)</span>&#9120;, &#9117;&#947;<span style="color: #2aa198;">(</span>x&#8323;<span style="color: #2aa198;">)</span>&#9120; &#9132;
     &#9129;          ======= &#9133; 

Sub &#9127; &#9115;x&#8321;      &#9118;  &#9115;x&#8322;   &#9118; &#9131;
==&gt; &#9128; &#9117;&#947;<span style="color: #2aa198;">(</span>&#947;<span style="color: #b58900;">(</span>x&#8323;<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>&#9120;, &#9117;&#947;<span style="color: #2aa198;">(</span>x&#8323;<span style="color: #2aa198;">)</span>&#9120; &#9132; &#8838; &#966;
    &#9129;                     &#9133; 
</pre>
</div>

<ul class="org-ul">
<li>allgemeinster Unifikator:
<ul class="org-ul">
<li>φ: x₁ ↦ γ(γ(x₃)), x₂ ↦ γ(x₃), x₃ ↦ x₃</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga6b612f" class="outline-3">
<h3 id="orga6b612f"><span class="section-number-3">3.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>weitere Unifikatoren
<ul class="org-ul">
<li>φ₁: x₁ ↦ γ(γ(α)), x₂ ↦ γ(α), x₃ ↦ α</li>
<li>φ₂: x₁ ↦ γ(γ(γ(α))), x₂ ↦ γ(γ(α)), x₃ ↦ γ(α)</li>
<li>φ₃: x₁ ↦ γ(γ(γ(x₃))), x₂ ↦ γ(γ(x₃)), x₃ ↦ γ(x₃)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org74dfbb4" class="outline-3">
<h3 id="org74dfbb4"><span class="section-number-3">3.3</span> Teilaufgabe</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>t₁ = σ(x₁, x₂   )</li>
<li>t₂ = σ(x₂, γ(x₂))</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-05-02</p>
<p class="date">Created: 2019-05-02 Do 13:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
